/*---------------------------------------------------------------------
* 			Copyright (C) 2020 TECHSCAN 版权所有。
*           www.techscan.cn
*┌──────────────────────────────────┐
*│　此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．　│
*│　版权所有：上海太迅自动识别技术有限公司 　 　　　　　　　　　　　　│
*└──────────────────────────────────┘
*
* 文件名：   BaseCallResult.cs
* 功能描述： 异步调用结果类
* 作者：     Myl
* CLR版本：  4.0.30319.42000
* 创建时间： 2020-01-10 21:25:05
* Client：   MYLPC
* 文件版本： V1.0.0

===============================版本履历===============================
* Ver 		变更日期 				负责人 	变更内容
* V1.0.0	2020-01-10 21:25:05		Myl		Create
*
======================================================================
//--------------------------------------------------------------------*/

namespace TechScan.Tool.U8.ServiceDeploy.Base.Utils
{
    /// <summary>
    /// 异步调用结果类
    /// </summary>
    public class BaseCallResult
    {
        #region Property
        /// <summary>
        /// 是否成功
        /// </summary>
        public bool IsOk
        {
            get; set;
        }
        /// <summary>
        /// 结果描述
        /// </summary>
        public string Msg
        {
            get; set;
        }
        #endregion
    }
}
