/*---------------------------------------------------------------------
* 			Copyright (C) 2019 TECHSCAN 版权所有。
*           www.techscan.cn
*┌──────────────────────────────────┐
*│　此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．　│
*│　版权所有：上海太迅自动识别技术有限公司 　 　　　　　　　　　　　　│
*└──────────────────────────────────┘
*
* 文件名：   HistoryType.cs
* 功能描述： 操作历史类型枚举
* 作者：     Myl
* CLR版本：  4.0.30319.42000
* 创建时间： 2019-12-30 13:06:38
* Client：   MYLPC
* 文件版本： V1.0.0

===============================版本履历===============================
* Ver 		变更日期 				负责人 	变更内容
* V1.0.0	2019-12-30 13:06:38		Myl		Create
*
======================================================================
//--------------------------------------------------------------------*/

namespace TechScan.Tool.U8.ServiceDeploy.Base.Enums
{
    /// <summary>
    /// 操作历史类型枚举
    /// </summary>
    public enum HistoryType
    {
        /// <summary>
        /// U8 Android 服务打包历史
        /// </summary>
        PACK_IIS,
        /// <summary>
        /// SQL脚本打包历史
        /// </summary>
        PACK_SQL,
        /// <summary>
        /// U8Android 部署历史
        /// </summary>
        DEPLOY_IIS,
        /// <summary>
        /// SQL脚本执行历史
        /// </summary>
        DEPLOY_SQL
    }
}
