/*---------------------------------------------------------------------
* 			Copyright (C) 2020 TECHSCAN 版权所有。
*           www.techscan.cn
*┌──────────────────────────────────┐
*│　此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．　│
*│　版权所有：上海太迅自动识别技术有限公司 　 　　　　　　　　　　　　│
*└──────────────────────────────────┘
*
* 文件名：   PackageType.cs
* 功能描述： 包类型枚举
* 作者：     Myl
* CLR版本：  4.0.30319.42000
* 创建时间： 2020-01-02 19:52:50
* Client：   MYLPC
* 文件版本： V1.0.0

===============================版本履历===============================
* Ver 		变更日期 				负责人 	变更内容
* V1.0.0	2020-01-02 19:52:50		Myl		Create
*
======================================================================
//--------------------------------------------------------------------*/
//https://www.cnblogs.com/zhangxiaoyong/p/7452408.html

namespace TechScan.Tool.U8.ServiceDeploy.Base.Enums
{
    /// <summary>
    /// 包类型枚举
    /// </summary>
    public enum PackageType
    {
        /// <summary>
        /// 内部测试版
        /// </summary>
        Alpha,
        /// <summary>
        /// 外部测试版
        /// </summary>
        Beta,
        /// <summary>
        /// 演示版
        /// </summary>
        Demo,
        /// <summary>
        /// 增强版或加强版
        /// （针对某个特定用户的特定加强功能：比如某个客户出库的单据参照的特殊条件等）
        /// </summary>
        Enhanced,
        /// <summary>
        /// 发行版
        /// （统一对外发行的）
        /// </summary>
        Release
    }
}
